"""PSIT2017"""
import pygal #เรียกใช้ Pygal
def main():
    """Render Employee or Unemployee"""
    chart = pygal.Line(title='กราฟเส้นแสดงตัวเลขผู้ว่างงานและผู้มีงานทำของคนไทยทั่วประเทศ ระหว่างปี 2550-2559') #ชื่อกราฟ แสดงอยู่บนสุด
    chart.x_labels = ('2550', '2551', '2552', '2553', '2554', '2555', '2556', '2557', '2558', '2559') #ตัวเลขในแกนX(แนวนอน) #แสดงช่วงเวลา
    num = int(input()) #ใส่อินพุตเพื่อเลือกว่าจะเอากราฟไหน
    if num == 1:
        chart.add('จำนวนผู้ว่างงาน', [508475, 521980, 572336, 402181, 264339, 259094, 283520, 322675, 340561, 377466]) #เพิ่มตัวเลขเข้าไปในกราฟตามListที่ใส่
    elif num == 2:
        chart.add('จำนวนผู้มีงานทำ', [36249454, 37016612, 37706321, 38037342, 38464667, 38939130, 38906889, 38077429, 38016169, 37692651]) #เพิ่มตัวเลขเข้าไปในกราฟตามListที่ใส่
    chart.render_in_browser() #สั่งเรนเดอร์บนบราวเซอร์ = เปิดในเว็บ
main()
